---
kind: method
id: M:Autodesk.Revit.DB.FailureMessageAccessor.GetFailureDefinitionId
source: html/fd22e6c5-1482-2568-6a66-0187aafd756c.htm
---
# Autodesk.Revit.DB.FailureMessageAccessor.GetFailureDefinitionId Method

Retrieves the Id of the FailureDefinition of the failure.

## Syntax (C#)
```csharp
public FailureDefinitionId GetFailureDefinitionId()
```

## Returns
The Id of the FailureDefinition of the failure.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This FailureMessageAccessor has not been properly initialized.